<script>
	import { ellipsis } from './ellipsis.js'
</script>
<div class='group'>
	<div class='section'>
		<p use:ellipsis on:click = "{() => console.log('2321')}">
			Ничем. В России много замечательных врачей — медицинское образование у нас по-прежнему на высоте. Однако технологии (в том числе, и диагностические) отстают: в большинстве российских клиник нет оборудования, позволяющего провести 100% диагностику или сложную операцию. А там, где оно есть, стоимость лечения может оказаться запредельной. В иностранных клиниках на вооружении опытных врачей находится самое современное диагностическое оборудование, медицинская техника и методики лечения последнего поколения. Без правильной диагностики не может быть правильного лечения. Неверный или неуточненный диагноз может привести к самым роковым последствиям. Зарубежные методы диагностики современны, точны и достоверны. Помните, чем раньше поставлен верный диагноз, тем выше шансы на выздоровление. Оснащение зарубежных клиник высокотехнологичным оборудованием позволяет проводить качественную диагностику и эффективное лечение. Вот почему мы рекомендуем обследоваться и лечиться за рубежом.
		</p>
	</div>
	<div class='section'>
		<p>
			Ничем. В России много замечательных врачей — медицинское образование у нас по-прежнему на высоте. Однако технологии (в том числе, и диагностические) отстают: в большинстве российских клиник нет оборудования, позволяющего провести 100% диагностику или сложную операцию. А там, где оно есть, стоимость лечения может оказаться запредельной. В иностранных клиниках на вооружении опытных врачей находится самое современное диагностическое оборудование, медицинская техника и методики лечения последнего поколения. Без правильной диагностики не может быть правильного лечения. Неверный или неуточненный диагноз может привести к самым роковым последствиям. Зарубежные методы диагностики современны, точны и достоверны. Помните, чем раньше поставлен верный диагноз, тем выше шансы на выздоровление. Оснащение зарубежных клиник высокотехнологичным оборудованием позволяет проводить качественную диагностику и эффективное лечение. Вот почему мы рекомендуем обследоваться и лечиться за рубежом.
		</p>
	</div>
</div>


<style>
	.group {
		display: flex;
	}
	.section {
		max-height: 243px;
		height: 100%;
		overflow: hidden;
	}
	p {
		position: relative;
		display: inline-block;
	}
</style>
