<script>
	import { ellipsis } from './ellipsis.js'
	let state = 1;
	let txt1 = `Представим ситуацию, когда вы подключаете сторонний скрипт, который добавляет какую-то полезную функциональность на страницу, но при этом делает что-то лишнее, например, показывает рекламу <div class="ads">Ненужная реклама</div>. Разумеется, сторонний скрипт не даёт каких-то механизмов её убрать. Используя MutationObserver, мы можем отследить, когда в нашем DOM появится такой элемент и удалить его. А полезную функциональность оставить. Хотя, конечно, создатели стороннего скрипта вряд ли обрадуются, что вы их полезный скрипт взяли, а рекламу удалили. сть и другие ситуации, когда сторонний скрипт добавляет что-то в наш документ, и мы хотели бы отследить, когда это происходит, чтобы адаптировать нашу страницу, динамически поменять какие-то размеры и т.п.`
	let txt2 = 'Ничем. В России много замечательных врачей — медицинское образование у нас по-прежнему на высоте. Однако технологии (в том числе, и диагностические) отстают: в большинстве российских клиник нет оборудования, позволяющего провести 100% диагностику или сложную операцию. А там, где оно есть, стоимость лечения может оказаться запредельной. В иностранных клиниках на вооружении опытных врачей находится самое современное диагностическое оборудование, медицинская техника и методики лечения последнего поколения. Без правильной диагностики не может быть правильного лечения. Неверный или неуточненный диагноз может привести к самым роковым последствиям. Зарубежные методы диагностики современны, точны и достоверны. Помните, чем раньше поставлен верный диагноз, тем выше шансы на выздоровление. Оснащение зарубежных клиник высокотехнологичным оборудованием позволяет проводить качественную диагностику и эффективное лечение. Вот почему мы рекомендуем обследоваться и лечиться за рубежом.'
	let text = txt1;
	let nodeEl;
	function handler(){
		console.log('click')
		text = state == 1 ? txt2 : txt1;
		nodeEl.style.fontWeight = state == 1 ? '800' : '400';
		nodeEl.style.fontSize = state == 1 ? '20px' : '16px';
		state = state == 1 ? 2 : 1;
	}
</script>
<div class='group'>
	<div class='section' on:click = {handler}>
		<p use:ellipsis bind:this = {nodeEl} >
			{text}
		</p>
	</div>
	<!-- <div class='section'>
		<p use:ellipsis >
			{text}
		</p>
	</div> -->
</div>


<style>
	.group {
		display: grid;
		grid-template-columns: 1fr 1fr;
	}
	.section {
		/* max-height: 243px; */
		height: 200px;
		overflow: hidden;
		background: beige;
	}
	p {
		font-size: 16px;
		position: relative;
		display: inline-block;
	}
</style>
